# Словарь для перевода названий морфологических характеристик (ключей)
MORPH_FEATURES_TRANSLATIONS = {
    "pos": "Часть речи",
    "Aspect": "Вид",
    "Mood": "Наклонение",
    "Number": "Число",
    "Person": "Лицо",
    "Tense": "Время",
    "VerbForm": "Форма глагола",
    "Voice": "Залог",
    "Case": "Падеж",
    "Degree": "Степень",
    "Gender": "Род",
    "Animacy": "Одушевлённость",
    "Variant": "Форма",
    "Polarity": "Значение",
}

# Словарь для перевода значений характеристик
MORPH_VALUES_TRANSLATIONS = {
    "pos": {
        "NOUN": "Существительное",
        "VERB": "Глагол",
        "ADJ": "Прилагательное",
        "ADV": "Наречие",
        "PRON": "Местоимение",
        # "DET": "Определительное местоимение",
        "ADP": "Предлог",
        "CONJ": "Союз",
        # "CCONJ": "Сочинительный союз",
        # "SCONJ": "Подчинительный союз",
        "PART": "Частица",
        "NUM": "Числительное",
        "INTJ": "Междометие",
        # "PROPN": "Имя собственное",
        # "AUX": "Вспомогательный глагол",
        "X": "Не определено"
    },
    "Polarity": {
      "Neg": "Отрицательная"
    },
    "Variant": {
        "Short": "Краткое",
    },
    "Animacy": {
        "Inan": "Неодушевлённое",
        "Anim": "Одушевлённое",
    },
    "Gender": {
        "Fem": "Женский",
        "Masc": "Мужской",
        "Neut": "Средний",
    },
    "Aspect": {
        "Imp": "Несовершенный",
        "Perf": "Совершенный"
    },
    "Mood": {
        "Ind": "Изъявительное",
        "Sub": "Сослагательное",
        "Imp": "Повелительное"
    },
    "Number": {
        "Sing": "Единственное",
        "Plur": "Множественное"
    },
    "Person": {
        "1": "Первое",
        "2": "Второе",
        "3": "Третье"
    },
    "Tense": {
        "Pres": "Настоящее",
        "Past": "Прошедшее",
        "Fut": "Будущее"
    },
    "VerbForm": {
        "Fin": "Личная форма",
        "Inf": "Инфинитив",
        "Part": "Причастие",
        "Conv": "Деепричастие"
    },
    "Voice": {
        "Act": "Активный",
        "Mid": "Средний",
        "Pass": "Пассивный"
    },
    "Case": {
        "Nom": "Именительный",
        "Gen": "Родительный",
        "Dat": "Дательный",
        "Acc": "Винительный",
        "Ins": "Творительный",
        "Loc": "Предложный"
    },
    "Degree": {
        "Pos": "Положительная",
        "Cmp": "Сравнительная",
        "Sup": "Превосходная"
    }
}