# Словарь для перевода названий морфологических характеристик (ключей)
MORPH_FEATURES_RU = {
    "Aspect": "Вид",
    "Mood": "Наклонение",
    "Number": "Число",
    "Person": "Лицо",
    "Tense": "Время",
    "VerbForm": "Форма глагола",
    "Voice": "Залог",
    "Case": "Падеж",
    "Degree": "Степень",
    "Gender": "Род",
    "Animacy": "Одушевлённость"
}

# Словарь для перевода значений характеристик
MORPH_TRANSLATIONS = {
    "Aspect": {
        "Imp": "несовершенный вид",
        "Perf": "совершенный вид"
    },
    "Mood": {
        "Ind": "изъявительное наклонение",
        "Sub": "сослагательное наклонение",
        "Imp": "повелительное наклонение"
    },
    "Number": {
        "Sing": "единственное",
        "Plur": "множественное"
    },
    "Person": {
        "1": "первое лицо",
        "2": "второе лицо",
        "3": "третье лицо"
    },
    "Tense": {
        "Pres": "настоящее время",
        "Past": "прошедшее время",
        "Fut": "будущее время"
    },
    "VerbForm": {
        "Fin": "личная форма",
        "Inf": "инфинитив",
        "Part": "причастие"
    },
    "Voice": {
        "Act": "активный залог",
        "Mid": "средний залог",
        "Pass": "пассивный залог"
    },
    "Case": {
        "Nom": "именительный падеж",
        "Gen": "родительный падеж",
        "Dat": "дательный падеж",
        "Acc": "винительный падеж",
        "Ins": "творительный падеж",
        "Loc": "предложный падеж"
    },
    "Degree": {
        "Pos": "положительная степень",
        "Cmp": "сравнительная степень",
        "Sup": "превосходная степень"
    }
}

POS_TRANSLATIONS = {
            "NOUN": "Существительное",
            "VERB": "Глагол",
            "ADJ": "Прилагательное",
            "ADV": "Наречие",
            "PRON": "Местоимение",
            "DET": "Определитель",
            "ADP": "Предлог",
            "CCONJ": "Сочинительный союз",
            "SCONJ": "Подчинительный союз",
            "PART": "Частица",
            "NUM": "Числительное",
            "INTJ": "Междометие",
            "PROPN": "Имя собственное",
            "AUX": "Вспомогательный глагол",
            "X": "Неопределенная категория"
        }